artillery-tests/artillery-output-api.txt

> nodebb@4.4.6 artillery:api
> artillery run artillery-tests/artillery-test-api.yml --output artillery-tests/artillery-results-api.json

Test run id: tkmaz_3e6aqfjcwdex7qrhdm5q4ac5d6gze_bwqr
Phase started: API load test (index: 0, duration: 60s) 01:35:15(+0000)

--------------------------------------
Metrics for period to: 01:35:20(+0000) (width: 4.013s)
--------------------------------------

http.codes.200: ................................................................ 366
http.downloaded_bytes: ......................................................... 2297626
http.request_rate: ............................................................. 104/sec
http.requests: ................................................................. 366
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 38
  mean: ........................................................................ 4.2
  median: ...................................................................... 2
  p95: ......................................................................... 19.9
  p99: ......................................................................... 30.9
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 38
  mean: ........................................................................ 4.2
  median: ...................................................................... 2
  p95: ......................................................................... 19.9
  p99: ......................................................................... 30.9
http.responses: ................................................................ 366
vusers.completed: .............................................................. 61
vusers.created: ................................................................ 61
vusers.created_by_name.API endpoints testing: .................................. 61
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 10
  max: ......................................................................... 177.2
  mean: ........................................................................ 38.1
  median: ...................................................................... 18
  p95: ......................................................................... 144
  p99: ......................................................................... 156


--------------------------------------
Metrics for period to: 01:35:30(+0000) (width: 9.791s)
--------------------------------------

http.codes.200: ................................................................ 900
http.downloaded_bytes: ......................................................... 5649900
http.request_rate: ............................................................. 97/sec
http.requests: ................................................................. 900
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 324
  mean: ........................................................................ 11
  median: ...................................................................... 2
  p95: ......................................................................... 80.6
  p99: ......................................................................... 172.5
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 324
  mean: ........................................................................ 11
  median: ...................................................................... 2
  p95: ......................................................................... 80.6
  p99: ......................................................................... 172.5
http.responses: ................................................................ 900
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.API endpoints testing: .................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 9.3
  max: ......................................................................... 1003.2
  mean: ........................................................................ 91.3
  median: ...................................................................... 18
  p95: ......................................................................... 459.5
  p99: ......................................................................... 963.1


--------------------------------------
Metrics for period to: 01:35:40(+0000) (width: 9.782s)
--------------------------------------

http.codes.200: ................................................................ 900
http.downloaded_bytes: ......................................................... 5649900
http.request_rate: ............................................................. 97/sec
http.requests: ................................................................. 900
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 39
  mean: ........................................................................ 1.7
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 7
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 39
  mean: ........................................................................ 1.7
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 7
http.responses: ................................................................ 900
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.API endpoints testing: .................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8.6
  max: ......................................................................... 80.8
  mean: ........................................................................ 14.1
  median: ...................................................................... 11.8
  p95: ......................................................................... 25.3
  p99: ......................................................................... 37.7


--------------------------------------
Metrics for period to: 01:35:50(+0000) (width: 9.79s)
--------------------------------------

http.codes.200: ................................................................ 900
http.downloaded_bytes: ......................................................... 5649900
http.request_rate: ............................................................. 97/sec
http.requests: ................................................................. 900
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 64
  mean: ........................................................................ 1.5
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 64
  mean: ........................................................................ 1.5
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 900
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.API endpoints testing: .................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8.3
  max: ......................................................................... 95.3
  mean: ........................................................................ 12.8
  median: ...................................................................... 11.1
  p95: ......................................................................... 21.1
  p99: ......................................................................... 26.8


--------------------------------------
Metrics for period to: 01:36:00(+0000) (width: 9.79s)
--------------------------------------

http.codes.200: ................................................................ 900
http.downloaded_bytes: ......................................................... 5649900
http.request_rate: ............................................................. 97/sec
http.requests: ................................................................. 900
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 231
  mean: ........................................................................ 2
  median: ...................................................................... 1
  p95: ......................................................................... 4
  p99: ......................................................................... 15
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 231
  mean: ........................................................................ 2
  median: ...................................................................... 1
  p95: ......................................................................... 4
  p99: ......................................................................... 15
http.responses: ................................................................ 900
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.API endpoints testing: .................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 8.5
  max: ......................................................................... 295.3
  mean: ........................................................................ 18
  median: ...................................................................... 11.6
  p95: ......................................................................... 36.2
  p99: ......................................................................... 70.1


--------------------------------------
Metrics for period to: 01:36:10(+0000) (width: 9.804s)
--------------------------------------

http.codes.200: ................................................................ 900
http.downloaded_bytes: ......................................................... 5649900
http.request_rate: ............................................................. 97/sec
http.requests: ................................................................. 900
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 9
  mean: ........................................................................ 1.5
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 9
  mean: ........................................................................ 1.5
  median: ...................................................................... 1
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 900
vusers.completed: .............................................................. 150
vusers.created: ................................................................ 150
vusers.created_by_name.API endpoints testing: .................................. 150
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7.6
  max: ......................................................................... 27.6
  mean: ........................................................................ 12.2
  median: ...................................................................... 11.4
  p95: ......................................................................... 18.7
  p99: ......................................................................... 25.3


Phase completed: API load test (index: 0, duration: 60s) 01:36:15(+0000)

--------------------------------------
Metrics for period to: 01:36:20(+0000) (width: 5.784s)
--------------------------------------

http.codes.200: ................................................................ 534
http.downloaded_bytes: ......................................................... 3352274
http.request_rate: ............................................................. 97/sec
http.requests: ................................................................. 534
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 1.2
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 4
  mean: ........................................................................ 1.2
  median: ...................................................................... 1
  p95: ......................................................................... 2
  p99: ......................................................................... 3
http.responses: ................................................................ 534
vusers.completed: .............................................................. 89
vusers.created: ................................................................ 89
vusers.created_by_name.API endpoints testing: .................................. 89
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7.6
  max: ......................................................................... 18.2
  mean: ........................................................................ 10.5
  median: ...................................................................... 9.7
  p95: ......................................................................... 15.3
  p99: ......................................................................... 18


All VUs finished. Total time: 1 minute, 2 seconds

--------------------------------
Summary report @ 01:36:18(+0000)
--------------------------------

http.codes.200: ................................................................ 5400
http.downloaded_bytes: ......................................................... 33899400
http.request_rate: ............................................................. 97/sec
http.requests: ................................................................. 5400
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 324
  mean: ........................................................................ 3.4
  median: ...................................................................... 1
  p95: ......................................................................... 6
  p99: ......................................................................... 57.4
http.response_time.2xx:
  min: ......................................................................... 0
  max: ......................................................................... 324
  mean: ........................................................................ 3.4
  median: ...................................................................... 1
  p95: ......................................................................... 6
  p99: ......................................................................... 57.4
http.responses: ................................................................ 5400
vusers.completed: .............................................................. 900
vusers.created: ................................................................ 900
vusers.created_by_name.API endpoints testing: .................................. 900
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 7.6
  max: ......................................................................... 1003.2
  mean: ........................................................................ 28.4
  median: ...................................................................... 12.1
  p95: ......................................................................... 61
  p99: ......................................................................... 459.5
Log file: artillery-tests/artillery-results-api.json